Tekla Open API Reference for Tekla Structures 2025
Class Methods
The ReinforcingBarFilterExpressions.Class type exposes the following members.
Methods
Name | Description
ToString
 Creates a string representation of the current object.
 (Inherited from DataFilterExpression.)
Top
See Also
Reference
ReinforcingBarFilterExpressions.Class Class
Tekla.Structures.Filtering.Categories Namespace